Res-firecracker-random-v66/firecracker_t_4_c_6_frontVcpu_1_wrkVcpu_2/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5022.052ms, rate sampling interval: 17235ms
  Thread calibration: mean lat.: 5169.420ms, rate sampling interval: 17940ms
  Thread calibration: mean lat.: 5103.180ms, rate sampling interval: 18022ms
  Thread calibration: mean lat.: 5192.836ms, rate sampling interval: 18087ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    22.50s    10.99s    0.86m    79.96%
    Req/Sec   276.12      3.22   281.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.84s 
 75.000%   30.18s 
 90.000%   38.90s 
 99.000%    0.86m 
 99.900%    0.87m 
 99.990%    0.87m 
 99.999%    0.88m 
100.000%    0.88m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9601.023     0.000000            2         1.00
   11780.095     0.100000         5530         1.11
   12476.415     0.200000        11050         1.25
   13688.831     0.300000        16551         1.43
   18071.551     0.400000        22060         1.67
   18841.599     0.500000        27580         2.00
   19202.047     0.550000        30321         2.22
   19939.327     0.600000        33080         2.50
   24543.231     0.650000        35841         2.86
   29327.359     0.700000        38597         3.33
   30179.327     0.750000        41351         4.00
   30457.855     0.775000        42745         4.44
   30736.383     0.800000        44128         5.00
   31014.911     0.825000        45570         5.71
   31342.591     0.850000        46873         6.67
   34766.847     0.875000        48239         8.00
   36732.927     0.887500        48931         8.89
   38895.615     0.900000        49623        10.00
   41123.839     0.912500        50313        11.43
   43483.135     0.925000        50996        13.33
   45973.503     0.937500        51685        16.00
   47120.383     0.943750        52036        17.78
   48398.335     0.950000        52376        20.00
   49741.823     0.956250        52719        22.86
   50462.719     0.962500        53074        26.67
   50790.399     0.968750        53411        32.00
   50921.471     0.971875        53581        35.56
   51052.543     0.975000        53765        40.00
   51183.615     0.978125        53946        45.71
   51314.687     0.981250        54134        53.33
   51445.759     0.984375        54314        64.00
   51478.527     0.985938        54359        71.11
   51544.063     0.987500        54460        80.00
   51609.599     0.989062        54549        91.43
   51675.135     0.990625        54619       106.67
   51773.439     0.992188        54732       128.00
   51806.207     0.992969        54763       142.22
   51838.975     0.993750        54799       160.00
   51871.743     0.994531        54835       182.86
   51937.279     0.995313        54910       213.33
   51970.047     0.996094        54948       256.00
   51970.047     0.996484        54948       284.44
   52002.815     0.996875        54976       320.00
   52035.583     0.997266        54996       365.71
   52068.351     0.997656        55007       426.67
   52133.887     0.998047        55027       512.00
   52199.423     0.998242        55043       568.89
   52199.423     0.998437        55043       640.00
   52264.959     0.998633        55054       731.43
   52297.727     0.998828        55066       853.33
   52330.495     0.999023        55079      1024.00
   52363.263     0.999121        55092      1137.78
   52363.263     0.999219        55092      1280.00
   52363.263     0.999316        55092      1462.86
   52396.031     0.999414        55100      1706.67
   52428.799     0.999512        55107      2048.00
   52428.799     0.999561        55107      2275.56
   52461.567     0.999609        55119      2560.00
   52461.567     0.999658        55119      2925.71
   52461.567     0.999707        55119      3413.33
   52461.567     0.999756        55119      4096.00
   52461.567     0.999780        55119      4551.11
   52461.567     0.999805        55119      5120.00
   52494.335     0.999829        55125      5851.43
   52494.335     0.999854        55125      6826.67
   52494.335     0.999878        55125      8192.00
   52494.335     0.999890        55125      9102.22
   52494.335     0.999902        55125     10240.00
   52494.335     0.999915        55125     11702.86
   52494.335     0.999927        55125     13653.33
   52527.103     0.999939        55129     16384.00
   52527.103     1.000000        55129          inf
#[Mean    =    22495.793, StdDeviation   =    10994.274]
#[Max     =    52494.336, Total count    =        55129]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  65732 requests in 1.00m, 27.18MB read
Requests/sec:   1095.44
Transfer/sec:    463.86KB